cases/chpt4-tin-CC-506-a/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    hot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          65;
        startFace       12440;
    }
    hotTop
    {
        type            patch;
        nFaces          5;
        startFace       12505;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          65;
        startFace       12510;
    }
    coldTop
    {
        type            patch;
        nFaces          5;
        startFace       12575;
    }
    top
    {
        type            patch;
        nFaces          90;
        startFace       12580;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       12670;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12600;
        startFace       12760;
    }
)

// ************************************************************************* //
